; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 506738 1 2 4 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared2 - mode
	infrared0 - mode
	thermograph3 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(have_image Star8 infrared0)
	(have_image Planet9 infrared2)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 thermograph3)
	(have_image Star12 spectrograph1)
	(have_image Planet13 infrared2)
))

)

; plan
1. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation7)
   goals met: 0 of 6
4. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 0 of 6
5. (turn_to satellite0 star8 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
6. (turn_to satellite0 star12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star12)
   goals met: 0 of 6
7. (take_image satellite0 star12 instrument1 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 1 of 6
8. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 1 of 6
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 6
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
11. (turn_to satellite0 groundstation5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 6
12. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 1 of 6
13. (turn_to satellite0 star8 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star8)
   goals met: 1 of 6
14. (take_image satellite0 star8 instrument0 infrared0)
   added: (have_image star8 infrared0)
   goals met: 2 of 6
15. (turn_to satellite0 star11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star11)
   goals met: 2 of 6
16. (take_image satellite0 star11 instrument0 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 3 of 6
17. (turn_to satellite0 planet9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet9)
   goals met: 3 of 6
18. (take_image satellite0 planet9 instrument0 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 4 of 6
19. (turn_to satellite0 planet13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet13)
   goals met: 4 of 6
20. (take_image satellite0 planet13 instrument0 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 5 of 6
21. (turn_to satellite0 phenomenon10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon10)
   goals met: 5 of 6
22. (take_image satellite0 phenomenon10 instrument0 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 6 of 6
